W8D1/reddit_clone/app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs"
---
    def new
        @post = Post.new
        @subs = Sub.all

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Make money"], ["url", ""], ["content", "Make more money"], ["sub_id", 3], ["author_id", 1], ["created_at", "2020-09-14 21:35:51.754162"], ["updated_at", "2020-09-14 21:35:51.754162"]]
---
    def create
        @post = Post.new(post_params)

        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @post = Post.find_by(id: params[:id])
        check = @post.author_id
        @user = User.find_by(id: check)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "testing again so much fun"], ["updated_at", "2020-09-14 22:10:43.329588"], ["id", 3]]
---
    def update
        @post = Post.find_by(id: params[:id])

        if @post && @post.update(post_params)