W8D1/reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Second Sub"], ["description", "Them cheetahs ain't noble"], ["user_id", 1], ["created_at", "2020-09-14 19:21:11.488730"], ["updated_at", "2020-09-14 19:21:11.488730"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = current_user.id
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "UPDATED"], ["updated_at", "2020-09-14 20:50:29.295988"], ["id", 3]]
---
    def update
        @sub = Sub.find_by(id: params[:id])
        return nil if @sub.nil?
        if (@sub.user_id == current_user.id) && (@sub.update(sub_params))