W6D4/art_share_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
  def index
    artwork = Artwork.all

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "updated_title"], ["image_url", "updated_test.com"], ["artist_id", 5], ["updated_at", "2020-09-03 23:37:33.596282"], ["id", 4]]
---
  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)