W6D5/cats99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        # debugger
        @cat = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "marron"], ["description", "Big kitten"], ["updated_at", "2020-09-04 22:33:25.947062"], ["id", 3]]
---
    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)