W6D3/first_routes/app/controllers/users_controller.rb

  def create
    # debugger
    user = User.new(user_params)
    # require - takes in the model name
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dog"], ["email", "dogdog@yahoo.com"], ["created_at", "2020-09-02 23:14:59.924852"], ["updated_at", "2020-09-02 23:14:59.924852"]]