W8D1/reddit_clone/app/views/subs/show.html.erb

<br>
<% if !@sub.posts.empty? %>
    <% @sub.posts.each do |post| %>
---
SELECT  1 AS one FROM "posts" WHERE "posts"."sub_id" = $1 LIMIT $2  [["sub_id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 3]]