W7D3/Music_App/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        debugger
        @user = User.find_by(id: params[:id])